# Журнал изменений
## Существует два способа делать записи в журнал изменений. ##

* Обычный способ, для людей без системы Git : создайте текстовый файл и начните перечислять все внесенные вами изменения с указанием определенной даты.

* Выбор разработчика и мастера владения Git : автоматическое создание списка изменений из ваших сообщений к коммитам. (как раз описанном чуть выше)

# Ветки в git
И тут БАМ ! и конфликт
Чтобы иметь возможность работать по каждому блоку отдельно не путаясь в коммитах и не превращая дерево изменений в сущий кошмар в Git существует возможность создавать новое ответвление с помощью команды git branch branch_name. И переместившись к нему командой
* git checout branch_name проводить работу в отдельном месте. 
(конфликт 3 не получился из-за того, что информацию можно было совместить автоматически)

# Слияние веток и решение конфликтов

После того, как мы закончили работу в ответвлении мы можем произвести слияние ( запускать его нужно из ветки **куда мы хотим переместить информацию из ответвления )

* производится это действие командой git merge branch_name

В случае конфликта нам показывают различия между двумя ветками и предлагают на выбор несколько действий выбрать которые мы можем с помощью щелчка мыши. 

# Удаление веток

Чтобы удалить ненужное ответвление мы можем использовать команду Git branch branch_mane -d

# Работа с удаленным репозиторием

Для работы с удаленным репозиторием необходимо:
* Создать аккаунт на Github.com
* Создать локальный репозиторий
* Подружить локальный и удаленный репозитории git remote add origin <путь> 
* Отправить локальный репозиторий на удаленный, командой git push
* после внесения изменений  в репозитории на сайте, необходимо обновить локальный репозиторий до актуальной версии командой git pull
* и т.д.

Для внесения изменений в чей-то удаленный репозиторий необходимо:
 * сделать Fork интерсующего репозитория (сохранить чужой репозиторий на своем аккаунте)
 * выполнить в терминале команду git clone
 * создать ветку с предлагаемыми изменениями
 * производить изменения только в этой ветке
 * командой git push отправить изменения в свой удаленный репозиторий
 * в окне на github появится возможность отправить измененный  репозиторий хозяину репозитория (pull request)

КОНЕЦ